<?php

// Создание многомерного массива с расписанием уроков в школе
$schedule = [
    "Понедельник" => ["Математика", "Литература", "Физика"],
    "Вторник" => ["Химия", "История", "Английский"],
    "Среда" => ["Биология", "География", "Информатика"],
    "Четверг" => ["Физкультура", "Музыка", "ИЗО"],
    "Пятница" => ["Русский язык", "Обществознание", "Трудовое обучение"]
];

// Вывод расписания на экран с использованием циклов
echo "Расписание уроков в школе:\n";
foreach ($schedule as $day => $lessons) {
    echo "$day:\n";
    foreach ($lessons as $lesson) {
        echo "- $lesson\n";
    }
}

?>